test/report/PostalCode_30RPS.log
2023-04-21 11:29:43,423 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2023-04-21 11:29:43,447 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2023-04-21 11:29:43,448 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2023-04-21 11:29:43,449 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2023-04-21 11:29:43,449 INFO o.a.j.JMeter: Setting JMeter property: Environment=Accep
2023-04-21 11:29:43,449 INFO o.a.j.JMeter: Setting JMeter property: RPS=1
2023-04-21 11:29:43,456 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2023-04-21 11:29:43,457 INFO o.a.j.JMeter: Version 5.5
2023-04-21 11:29:43,457 INFO o.a.j.JMeter: java.version=1.8.0_275
2023-04-21 11:29:43,458 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2023-04-21 11:29:43,458 INFO o.a.j.JMeter: os.name=Linux
2023-04-21 11:29:43,458 INFO o.a.j.JMeter: os.arch=amd64
2023-04-21 11:29:43,458 INFO o.a.j.JMeter: os.version=5.10.16.3-microsoft-standard-WSL2
2023-04-21 11:29:43,458 INFO o.a.j.JMeter: file.encoding=UTF-8
2023-04-21 11:29:43,459 INFO o.a.j.JMeter: java.awt.headless=true
2023-04-21 11:29:43,459 INFO o.a.j.JMeter: Max memory     =20090716160
2023-04-21 11:29:43,459 INFO o.a.j.JMeter: Available Processors =20
2023-04-21 11:29:43,464 INFO o.a.j.JMeter: Default Locale=English (EN)
2023-04-21 11:29:43,465 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2023-04-21 11:29:43,466 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2023-04-21 11:29:43,466 INFO o.a.j.JMeter: user.dir  =/opt/apache-jmeter-5.5
2023-04-21 11:29:43,466 INFO o.a.j.JMeter: PWD       =/opt/apache-jmeter-5.5
2023-04-21 11:29:43,467 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: 2a810961cbc1 FullName: 2a810961cbc1
2023-04-21 11:29:43,490 INFO o.a.j.s.FileServer: Default base='/opt/apache-jmeter-5.5'
2023-04-21 11:29:43,491 INFO o.a.j.s.FileServer: Set new base='/test'
2023-04-21 11:29:43,597 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2023-04-21 11:29:43,612 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2023-04-21 11:29:43,615 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2023-04-21 11:29:43,621 INFO o.a.j.s.SaveService: Loading file: /test/PostalCode.jmx
2023-04-21 11:29:43,676 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2023-04-21 11:29:43,677 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2023-04-21 11:29:43,677 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2023-04-21 11:29:43,677 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2023-04-21 11:29:43,888 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-21 11:29:43,888 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-21 11:29:43,889 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-21 11:29:43,890 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2023-04-21 11:29:43,891 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2023-04-21 11:29:43,892 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2023-04-21 11:29:44,119 INFO o.a.j.JMeter: Creating summariser <summary>
2023-04-21 11:29:44,126 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2023-04-21 11:29:44,127 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-04-21 11:29:44,128 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2023-04-21 11:29:44,133 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2023-04-21 11:29:44,133 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2023-04-21 11:29:44,386 INFO o.a.j.v.b.BackendListener: InfluxDB Backend Listener: Starting worker with class: class org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient and queue capacity: 5000
2023-04-21 11:29:44,387 INFO o.a.j.v.b.BackendListener: InfluxDB Backend Listener: Started  worker with class: class org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient
2023-04-21 11:29:44,602 INFO o.a.j.JMeter: Running test (1682069384602)
2023-04-21 11:29:44,722 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Output File
2023-04-21 11:29:44,723 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Output File.
2023-04-21 11:29:44,723 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-04-21 11:29:44,723 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2023-04-21 11:29:44,729 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2023-04-21 11:29:44,729 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 2 : PostalCode API - Accep - 1
2023-04-21 11:29:44,730 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group PostalCode API - Accep - 1.
2023-04-21 11:29:44,730 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2023-04-21 11:29:44,731 INFO o.a.j.t.JMeterThread: Thread started: Output File 1-1
2023-04-21 11:29:44,734 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2023-04-21 11:29:44,736 INFO c.b.j.t.c.ConcurrencyThreadStarter: Start supplying threads
2023-04-21 11:29:44,738 INFO o.a.j.t.JMeterThread: Thread started: PostalCode API - Accep - 1-ThreadStarter 2-1
2023-04-21 11:29:45,237 INFO o.a.j.t.JMeterThread: Thread is done: Output File 1-1
2023-04-21 11:29:45,238 INFO o.a.j.t.JMeterThread: Thread finished: Output File 1-1
2023-04-21 11:29:45,303 WARN k.a.j.t.VariableThroughputTimer: No free threads available in current Thread Group PostalCode API - Accep - 1, made 0 samples/s for expected rps 1.0 samples/s, increase your number of threads
2023-04-21 11:29:45,319 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 2a810961cbc1
2023-04-21 11:29:45,323 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2023-04-21 11:29:45,744 INFO o.a.j.t.JMeterThread: Thread started: PostalCode API - Accep - 1-ThreadStarter 2-2
2023-04-21 11:29:53,688 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2023-04-21 11:29:53,689 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2023-04-21 11:30:02,697 INFO o.a.j.r.Summariser: summary +     11 in 00:00:18 =    0.6/s Avg:  1909 Min:   327 Max:  8156 Err:     0 (0.00%) Active: 2 Started: 3 Finished: 1
2023-04-21 11:30:16,965 INFO o.a.j.r.ResultCollector: Shutdown hook started